finterest/app/models/user.rb

    def reset_session_token!
        # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "JhEL5IoB5Sm2jDNRl5Ykug"], ["updated_at", "2022-07-11 16:35:50.268869"], ["id", 20]]